[
  [
    "order",
    "batchNumber",
    "levelName",
    "makerName",
    "discordName",
    "makerId",
    "briefDescription",
    "progress",
    "difficultyName",
    "gameStyle",
    "Genre",
    "Music?",
    "mainTheme",
    "subTheme",
    "clearCondition",
    "averageClearTime",
    "description",
    "makerDescription",
    "difficulty",
    "tags",
    "nationality",
    "levelCode"
  ],
  [
    "1",
    "1",
    "The Bros Are Back in Town",
    "DTSpies",
    "DeathToSpies",
    "VHP-1VM-NSG",
    "The Boys Are Back in Town music level.",
    "\"Done\"",
    "Expert",
    "SMB3",
    "Platformer",
    "TRUE",
    "Ground Night",
    "Ground Night",
    "None",
    "Medium (1:30-4 minutes)",
    "In March of 1976, the Irish hard rock band Thin Lizzy released their sixth studio album, Jailbreak. This album included the single \"The Boys Are Back in Town\", which went on to become Thin Lizzy's biggest US hit and won the 1976 NME Award for Best Single.                        In August of 2022, The Mario Maker Celebration Project released an announcement trailer. That trailer included throwaway line referencing Thin Lizzy. This is the level that was made because of that throwaway line.",
    "DTSpies is still livin' downtown, drivin' all the old men crazy.",
    "5",
    "Music, Autoscroll",
    "us",
    "DHN-V2C-YXF"
  ],
  [
    "2",
    "1",
    "Wacky Wheel Waltz",
    "Kaito γ",
    "Kaito γ",
    "L1B-Q0D-1XF",
    "Dodge peepas that create circles and waves.",
    "\"Done\"",
    "Normal",
    "3DW",
    "Other",
    "FALSE",
    "Ghost House",
    "Ghost House",
    "None",
    "Medium (1:30-4 minutes)",
    "Wander into the warehouse to witness the weird white whirling wheels!",
    "Kaito likes to create traditional levels with interesting gimmicks. Some of his levels contain looping music, mostly using background music from Kirby series.",
    "3",
    "Gimmick, Traditional",
    "jp",
    "89N-F7W-7JG"
  ],
  [
    "3",
    "1",
    "NiceDonutBlock.jpg",
    "Tino",
    "Tino in the sky",
    "GFH-TQJ-NSG",
    "Doing nice donut block jumps",
    "\"Done\"",
    "Expert",
    "SMB3",
    "Gimmick",
    "FALSE",
    "Sky",
    "Sky",
    "None",
    "Short (< 1:30 minutes)",
    "Who would have thought that Bumpers — who have all right to be called Donut Blocks — and claws can synergize so well? This unusual duo will give you a boost to fly over obstacles and reach new areas to rise up high into the sky.",
    "Although he's lost quite a lot of his passion for Mario Maker 2 — definitely having overdosed on it the first year after it's release — Tino is still a maker you can count on to contribute when it’s time for the anniversary event. A random fun fact about him (as response to a certain person's persistence that he should tell more about himself): Tino once solved a Rubik's cube in under a minute and 10 seconds.",
    "6",
    "Gimmick",
    "de",
    "49F-C8K-J0G"
  ],
  [
    "4",
    "1",
    "Pressure Plates and Gates",
    "grakowsky",
    "grakowsky",
    "3CR-Q53-VHG",
    "Pressure plate driven on/off contraption puzzles",
    "\"Done\"",
    "Normal",
    "SMB3",
    "Puzzle",
    "FALSE",
    "Underground",
    "Underground",
    "None",
    "Long (> 4 minutes)",
    "Grakowsky thought, \"wouldn't it be cool to have a button contraption, like in Portal? I bet there'd be lots of applications!\" Being inspired, he made one. Then, Nabuz broke it and made a better one. Thanks Nabuz!",
    "Grakowsky still needs puzzles or he'll explode.",
    "3",
    "Puzzle",
    "us",
    "Q80-WXF-NTG"
  ],
  [
    "5",
    "1",
    "Cannonballoon Tycoon",
    "Nugukaza",
    "nugukaza",
    "62D-P0W-LSF",
    "P Ballooning inside a cage of cannonballs moving with the autoscroll. The cage is the shape of a balloon. Avoiding obstacles. ",
    "\"Done\"",
    "Expert",
    "SMW",
    "Precision",
    "FALSE",
    "Ghost House Night",
    "Underwater Night",
    "None",
    "Short (< 1:30 minutes)",
    "Float around the kingdom in your cannonballoon.",
    "Power Balloon aficionado.",
    "5",
    "Precision, P-Balloon",
    "us",
    "8R7-WHM-32G"
  ],
  [
    "6",
    "1",
    "Trampon/offline",
    "Luwuka",
    "Luwuka",
    "YY5-WK9-30G",
    "Mushroom Trampoline with lag",
    "\"Done\"",
    "Normal",
    "3DW",
    "Gimmick",
    "FALSE",
    "Castle",
    "Castle",
    "None",
    "Medium (1:30-4 minutes)",
    "Description is now loading... Please wait.",
    "Luwuka is out of the basement once again and now happy because 7YMM is here! Wait...",
    "5",
    "Gimmick",
    "br",
    "BNH-DTD-JCG"
  ],
  [
    "7",
    "1",
    "♪ Goombusters ♪",
    "Loup&Snoop",
    "Loup&Snoop",
    "PJT-7QY-SWF",
    "Koopas, brick blocks, and goombas. Traditional",
    "\"Done\"",
    "Normal",
    "SMB3",
    "Traditional",
    "TRUE",
    "Ghost House",
    "Ghost House",
    "None",
    "Medium (1:30-4 minutes)",
    "Invisible goomba sleepin' in your bed... Who you gonna call?",
    "Some people think we're a pair of American scientists, but we're actually Grakowsky's grandson. He was as surprised as we were. Makes all level types, but we are not responsible for the steaming hot garbage made by our evil twin living in Japan. Kappa ",
    "2",
    "Music, Traditional",
    "us",
    "07T-7TJ-3SG"
  ],
  [
    "8",
    "1",
    "Molesome Trolls",
    "Tutajkk",
    "Tutajkk#2435",
    "KR5-7T0-5LF",
    "A very beginner friendly troll level",
    "\"Done\"",
    "Easy",
    "SMW",
    "Troll",
    "FALSE",
    "Ground",
    "Ground Night",
    "None",
    "Medium (1:30-4 minutes)",
    "Simple, introductory troll level for players that aren't familiar with the genre. Have fun!",
    "I'm mostly known as the \"simple trolls\" creator, but you'll find a great variety of levels on my profile. While my trolls might trick and bamboozle you - my main goal is to put a smile on your face.",
    "3",
    "Troll",
    "hu",
    "8HC-T2Q-59G"
  ],
  [
    "9",
    "2",
    "FIFAnts アリヘイサッカーフィーバー",
    "RedMoon3",
    "Redmoon",
    "QJP-PQT-L8G",
    "The level of ants and ironballs",
    "\"Done\"",
    "Normal",
    "3DW",
    "Traditional",
    "FALSE",
    "Desert",
    "Desert",
    "None",
    "Medium (1:30-4 minutes)",
    "Ants like soccer. But they don't know the rules. ",
    "I have been making courses for about three years. I especially like gimmicks and beautiful art that you don't see very often elsewhere.",
    "3",
    "Traditional",
    "jp",
    "DF1-100-CDG"
  ],
  [
    "10",
    "2",
    "The Jumpman",
    "MrSparky",
    "MrElectrodude",
    "G11-K69-LGG",
    "Geometry Dash like platformer where the player is stuck between two blasters in clowncars",
    "\"Done\"",
    "Expert",
    "SMB3",
    "Platformer",
    "FALSE",
    "Snow",
    "Snow",
    "None",
    "Medium (1:30-4 minutes)",
    "Mario must prove his worth as the Jumpman.",
    "Mr Sparky (or MrElectrodude) came out of his shell to make a level for this year's anniversary.",
    "4",
    "Gimmick",
    "nl",
    "4RL-07P-4PF"
  ],
  [
    "11",
    "2",
    "A Heavy Lode",
    "Ryanarwhal",
    "Ryanarwhal",
    "L0L-PKM-6SF",
    "Precision level; exploring abandoned mining facility which leads to an ice cave",
    "\"Done\"",
    "Super Expert",
    "SMB3",
    "Precision",
    "FALSE",
    "Snow",
    "Snow Night",
    "None",
    "Short (< 1:30 minutes)",
    "Explore an old mining facility that has been out of commission for decades and enter the ice cave within.",
    "Precision player and maker.",
    "6",
    "Precision, Technical",
    "us",
    "NCX-6CL-TXG"
  ],
  [
    "12",
    "2",
    "Bone Base Breach",
    "Terimas",
    "Terimas",
    "1XC-1ND-HPF",
    "Fishbone stealth level as a P-balloon Mario",
    "\"Done\"",
    "Easy",
    "SMW",
    "Gimmick",
    "FALSE",
    "Sky Night",
    "Sky Night",
    "None",
    "Long (> 4 minutes)",
    "Bone Bass Bandits have stolen your precious mushrooms. Sneak into their base undetected and retrieve the stolen delicacies. However, avoid eating them all on the spot as bloating might make it challenging to escape... oh, too late.",
    "Mario is a platforming game? Not on Terimas' watch! He is a level maker who specializes in puzzles and all sorts of unconventional levels.",
    "5",
    "Stealth",
    "fi",
    "6VF-95X-DWF"
  ],
  [
    "13",
    "2",
    "The Great Spire",
    "3Good5You",
    "3good5you#5579",
    "9RY-BYQ-27G",
    "Complex link dungeon involving changing the central pillar's height. Red coins required. ",
    "\"Done\"",
    "Normal",
    "SMB",
    "Puzzle",
    "FALSE",
    "Underground",
    "Underground",
    "None",
    "Long (> 4 minutes)",
    "Navigate a winding link dungeon by changing the height of a central pillar. ",
    "Having started out his SMM2 journey making troll levels, 3good has branched out to making various types of puzzles over time as well. Also, don't tell anyone, but he's actually 4good6you, he's just modest. ",
    "6",
    "Puzzle, Link",
    "us",
    "Q6C-Y6R-TKG"
  ],
  [
    "14",
    "2",
    "Cannonpults",
    "Wiltini",
    "Wiltini",
    "7YT-MF9-NYG",
    "Fling yourself sky-high on the catapulting cannons within the airship…",
    "\"Done\"",
    "Expert",
    "SMB",
    "Gimmick",
    "FALSE",
    "Airship Night",
    "Airship Night",
    "None",
    "Medium (1:30-4 minutes)",
    "Fling yourself sky-high on the catapulting cannons within the airship…",
    "MakerName: Wiltini. Country/Region: Canada. LevelTypes: Gimmick/Platforming. Event: First. Height: Unspecified.",
    "4",
    "Gimmick",
    "ca",
    "4P7-YQ0-F0H"
  ],
  [
    "15",
    "2",
    "Layla",
    "Fehwul",
    "Fehwul and smpiano",
    "WN3-JH2-MYG",
    "Music level based around SMB2 powerup",
    "\"Done\"",
    "Expert",
    "SMB",
    "Platformer",
    "TRUE",
    "Snow",
    "Snow Night",
    "None",
    "Short (< 1:30 minutes)",
    "Let's make the best of the situation. Before I finally go insane.",
    "Smpiano makes some great music. Fehwul is in charge of not letting you listen to all of it.",
    "6",
    "Music, Autoscroll",
    "co",
    "NTT-9W2-FMG"
  ],
  [
    "16",
    "2",
    "Cloudmuncher",
    "Paxsman",
    "Paxsman#1573",
    "S2W-5WH-JLG",
    "Use stars to walk safely on munchers in clouds",
    "\"Done\"",
    "Expert",
    "SMB3",
    "Platformer",
    "FALSE",
    "Sky",
    "Sky",
    "None",
    "Medium (1:30-4 minutes)",
    "Eat a mass of incandescent gas to prevent any self harm from walking on cloud-bound munchers.",
    "Pax has currently achieved C-list celebrity status in the Mario community, but this hasn't provided the satisfaction he desired. He's currently trying to slide back to X-list for the pure and wholesome reason that X marks the spot.",
    "5",
    "Traditional",
    "us",
    "GGH-X8N-TKG"
  ],
  [
    "17",
    "3",
    "Gerudo Ruins Galaxy",
    "♪WBC♪",
    "WBC [KR]#4158",
    "G8V-HL0-RVF",
    "Great Adventure in the Great Palace with Looping Music!",
    "\"Done\"",
    "Normal",
    "SMB",
    "Puzzle",
    "TRUE",
    "Desert",
    "Desert",
    "None",
    "Medium (1:30-4 minutes)",
    "What makes the desert beautiful, is that somewhere it hides treasures. #TM",
    "Hello! I'm WBC. This time, I wanted to make a level by including the Master Sword. Solve Puzzles and Defeat Enemies in the Great Palace to Earn Rewards! Hope you enjoy! ",
    "3",
    "Music, Link",
    "kr",
    "G8V-HL0-RVF"
  ],
  [
    "18",
    "3",
    "Boogie Boolevard",
    "Theorymon",
    "Theorymon#7564",
    "23T-F50-5WG",
    "Stacked Boos chase you and react to direction detection!",
    "\"Done\"",
    "Expert",
    "NSMBU",
    "Gimmick",
    "FALSE",
    "Castle",
    "Sky Night",
    "None",
    "Medium (1:30-4 minutes)",
    "Welcome, new employees, to Boogie Boolevard, the hottest fitness center for boo-kind since 1988! Here in the Boolevard, we teach boos to boogie to the same direction as their Direction Jockey (DJ). Take pride in knowing that your work as a DJ is helping these boos shed pounds and avoid an early grave (for the second time). Just remember the golden rule: these boos are on a strict diet, so they're desperate to indulge. You look like a tasty morsel, so please don't feed the boos, you'll ruin all their hard work with a massive calorie infusion!",
    "Theorymon is a nerd who plays way too much Mario, competitive Pokemon, and Touhou, while also appreciating astrophysics and hiking. He loves to make players question the fundamentals of Mario with his courses in particular! Finally, he'd like to give special thanks for choo choo for vastly improving the pixel art for this course, and nickabuz and geitje for working on the mechanisms!\nThis course is dedicated to Theorymon's cat, Rollie, who sadly passed away this week. He loved to watch Mario.",
    "5",
    "Gimmick",
    "us",
    "SCF-WC3-R7G"
  ],
  [
    "19",
    "3",
    "Elastic Rebound Theory",
    "RadicalR",
    "RadicalReactions99",
    "L05-78J-BMG",
    "Various spring contraptions repeatedly bounce thwomps off of walls",
    "\"Done\"",
    "Expert",
    "SMB3",
    "Platformer",
    "FALSE",
    "Sky",
    "Sky",
    "None",
    "Medium (1:30-4 minutes)",
    "Thwart the throng of threatening thwomps that thunderously thwack things.",
    "RadicalR is a 15 year old maker from the US of A who has loved Mario for about as long as he can remember. Despite being basically unknown in the MM2 community, he is a somewhat versatile maker who loves building all kinds of levels, particularly platformers with unique gimmicks. YMM is what initially sparked him to start improving his levels and he is honored to be participating in its successor alongside some of his favorite makers.",
    "5",
    "Platforming",
    "us",
    "Q4X-05B-1GG"
  ],
  [
    "20",
    "3",
    "The Crumbling Ghost House ",
    "GreenStarC ",
    "GreenStarC ",
    "Y56-8L8-FKF",
    "Mario is in a crumbeling ghost house and breaks trough walls and floors  with red POWs",
    "\"Done\"",
    "Normal",
    "3DW",
    "Platformer",
    "FALSE",
    "Ghost House",
    "Ghost House",
    "None",
    "Medium (1:30-4 minutes)",
    "This house had its prime time. But now, after years with no one living in it (except some ghosts), it's ready to bite the dust. Each step will make it crumble more and may release an unwanted chain reaction. Watch your step!",
    "GreenStarC is known for his gimmick-driven style of level building, all about finding a gimmick and improving it to the next level.",
    "4",
    "Traditional ",
    "ch",
    "JRP-W77-GDG"
  ],
  [
    "21",
    "3",
    "TLoZ: Tempest Temple",
    "Pinktops",
    "Pinktops",
    "JN4-6J7-N2G",
    "Link course, like traditional an NES Zelda dungeon with puzzles and boss",
    "\"Done\"",
    "Normal",
    "SMB",
    "Traditional",
    "FALSE",
    "Desert Night",
    "Desert Night",
    "None",
    "Long (> 4 minutes)",
    "For the 7th year celebration Pinktops wanted to pay homage to Chicago, his home town, but his deep dish pizza and Oprah themed troll course was rejected by the judges, he made this windy Zelda course instead.",
    "Pinktops uses advanced mechanics to make memorable traditional courses that are, above all else, fun! AKA \"Pink Triceratops\" in the maker community, he is creative, cretaceous, and has three horns... which is 3x better than a unicorn. ",
    "4",
    "Puzzle, Link",
    "us",
    "6BR-S46-JMG"
  ],
  [
    "22",
    "3",
    "New Londo Ruins",
    "BigRedBoy²",
    "BigRedBoy",
    "KX5-WR5-JSG",
    "Kicking bone buckets into brick blocks",
    "\"Done\"",
    "Expert",
    "SMB",
    "Platformer",
    "FALSE",
    "Ghost House",
    "Ghost House",
    "None",
    "Long (> 4 minutes)",
    "bones break bricks :O",
    "BigRedBoy AKA \"The Large Crimson Lad\" is just some guy that's really big and really really red. Also, don't make him mad 'cause he bites. Furthermore, don't feed him anything cause he'll just want more food, and if you don't give him more food he'll get mad and then start biting. In conclusion, BigRedBoy's a nice guy.",
    "6",
    "Platforming, Autoscroll",
    "us",
    "0Y2-0XY-72G"
  ],
  [
    "23",
    "3",
    "Transformice",
    "MangMang69",
    "Mang",
    "4TF-6MS-74G",
    "on off switches change skipsqueakcolors",
    "\"Done\"",
    "Expert",
    "3DW",
    "Platformer",
    "FALSE",
    "Underground",
    "Underground",
    "None",
    "Medium (1:30-4 minutes)",
    "Help your cute mouse friends show their true colors. PridePog",
    "MangMang69 was Mang all along! D:",
    "6",
    "Gimmick, Platforming ",
    "de",
    "L87-6SP-J8G"
  ],
  [
    "24",
    "3",
    "♪ Moonsong ♪",
    "TempFunk",
    "TempestFunk#2735",
    "XXW-PBW-23G",
    "Getting over it Looping Music",
    "\"Done\"",
    "Expert",
    "SMB",
    "Platformer",
    "TRUE",
    "Underground",
    "Underground",
    "None",
    "Medium (1:30-4 minutes)",
    "There's no need to fear this 'Getting Over It' style level. We reduced the frustration to make way for plenty of secrets, shortcuts, and looping music from the indy cult classic CaveStory.",
    "“TempestFunk was told to write a description of himself for this section, but he’s better at making levels than he is writing descriptions, so now he’s just typing things hoping that eventually he’ll successfully fill up all the required spa”",
    "4",
    "Music, Bennett Foddy ",
    "ca",
    "G2P-QX3-6GF"
  ],
  [
    "25",
    "4",
    "Fishbone Flightline",
    "~Chichiri~",
    "Chichiri12345#6664",
    "D0M-NKR-BFF",
    "SMB2 fishbone/twister flight interactions",
    "\"Done\"",
    "Expert",
    "SMB",
    "Gimmick",
    "FALSE",
    "Sky",
    "Airship Night",
    "None",
    "Medium (1:30-4 minutes)",
    "Fly through the air on fast-paced fishbones! Harness the power of the SMB2 mushroom to turn foe into friend!",
    "Chichiri is known in the community for his troll levels, but decided to bring a piece of troll tech into the platforming world!",
    "4",
    "Platforming ",
    "ca",
    "245-4SC-MHG"
  ],
  [
    "26",
    "4",
    "Spike Mite Strike",
    "Nexar_",
    "Catshroomu#3618",
    "FGL-JHJ-21G",
    "A link puzzle level using the sheild to deflect spikeballs",
    "\"Done\"",
    "Expert",
    "SMB",
    "Puzzle",
    "FALSE",
    "Underground",
    "Underground",
    "None",
    "Long (> 4 minutes)",
    "A cave-in has Link trapped in a cave filled with the ferocious spike mites. Though they may be sharp and beastly, can he use them to carve a way out?",
    "Nexar is a maker who plays maker games and makes game to play",
    "5",
    "Puzzle, Link",
    "us",
    "S35-15Q-R7G"
  ],
  [
    "27",
    "4",
    "Domain of the Cloud Army",
    "ZachDivine",
    "Divine#0654",
    "BWW-CBS-DFF",
    "A level themed around spiketops/spinies in clouds and the various things you can do with them.  ",
    "\"Done\"",
    "Expert",
    "SMW",
    "Traditional",
    "FALSE",
    "Sky",
    "Sky",
    "None",
    "Medium (1:30-4 minutes)",
    "Climb your way up to the Royal Cloud Palace, maneuver your way through the Royal Guard's defenses, and engage in combat with the King of Clouds himself!",
    "Zach Divine is a maker who enjoys making semi-traditional levels accompanied by custom boss fights, and he's currently working on his own super world of them!  He wishes you good luck in your quest to conqueor the Domain of the Cloud Army!",
    "4",
    "Themed, Traditional ",
    "us",
    "268-TNB-KWF"
  ],
  [
    "28",
    "4",
    "Haunted Swamp",
    "Silen♰Moon",
    "Silen♰Moon",
    "X7K-79K-6KF",
    "The Swamp is Cursed. Every Night a path appears and dissapears again",
    "\"Done\"",
    "Normal",
    "NSMBU",
    "Gimmick",
    "FALSE",
    "Forest Night",
    "Forest Night",
    "None",
    "Short (< 1:30 minutes)",
    "An old legend tells of an enchanted swamp. But even the elders aren't sure which story about it is true. Some say that there is a path open for a true hero, and that the swamp reveals its secret. Others say the swamp tests anyone who dares to enter it. Others say the swamp is cursed and anyone who enters it is said to see a path that disappears a short time later. In the end, your job is to visit the swamp and find out which story is true and fill in the gap in the history books of the ancients.",
    "Silen♰Moon is a 21-year-old, non-satanic goth boy otaku from south west Germany. He enjoys playing video games like The Elder Scrolls series, The Legend of Zelda but also Splatoon 3. Silent aka Mica loves reading manga and watching anime. He also enjoys drawing and writing stories in his free time. But he also likes to walk his husky. Super Mario Maker 2 is the perfect place to unleash his creative streak. Best examples are \"Double Flower Shooter\" and \"Who is the Composer\". But he also loves to play cool and creative levels from other makers.",
    "3",
    "Gimmick, Traditional ",
    "de",
    "SPN-6SF-MVG"
  ],
  [
    "29",
    "4",
    "Wiggleworm Wanderlust",
    "Ry-bonez",
    "Rybonez",
    "B14-8HN-D8G",
    "nsmbu exploration and walljumping level that has a rotating checkpoint.",
    "\"Done\"",
    "Expert",
    "NSMBU",
    "Platformer",
    "FALSE",
    "Ghost House",
    "Ghost House",
    "None",
    "Long (> 4 minutes)",
    "Creaking corridors and cobwebbed corners hide a wealth of Wigglers, and a plethora of Pokeys. Toad heartily enters harrowing wormeaten hallways for an exploratory expedition through perilous puzzle-platforming pathways. Will he find secret passages filled with balloons, or plummet to his death down darkened pits?",
    "Rybonez has been making levels since the drop of SMM1. He prefers to build Super Expert platformers that require more than a little bit of consideration while playing through the first time, but become more natural with each section's playthrough. Truly satisfying setups with a few \"Ah-ha!\" moments are really what he feels are the necessary elements of a great level...but a touch of puzzly precision also never hurts.",
    "7",
    "Platforming, Puzzle",
    "us",
    "G04-87D-4PG"
  ],
  [
    "30",
    "4",
    "Lacerating Locomotive",
    "♪Sacha",
    "wSacha#8061",
    "LF4-P8F-6WG",
    "Spike balls platforming :)",
    "\"Done\"",
    "Super Expert",
    "SMW",
    "Platformer",
    "FALSE",
    "Castle",
    "Castle",
    "None",
    "Medium (1:30-4 minutes)",
    "This spiky train doesn't stop, so make sure you hitch a ride!",
    "Hi! I'm Sacha, a 15 years old nerd who loves coding, making music, and creating some epic Mario Maker levels :)",
    "6",
    "Platforming ",
    "ca",
    "J94-8G2-CXF"
  ],
  [
    "31",
    "4",
    "The Rosetta Block Trials",
    "rubenscube",
    "Ruben",
    "94H-XM1-DVG",
    "Sequence of pen and paper style logic puzzles inspired by the witness",
    "\"Done\"",
    "Normal",
    "NSMBU",
    "Puzzle",
    "FALSE",
    "Ground",
    "Forest",
    "None",
    "Long (> 4 minutes)",
    "On a distant island that appears on no map a mysterious block, later called the Rosetta block, was found. On the Rosetta block there were mysterious engravings that seemed to form some sort of a cryptic code. Ancient legends say that those who can decipher the code of the block may witness its deepest secrets...",
    "Rubenscube isn't really a cube, that's just his family name. He is actually a hexagonal prism.",
    "8",
    "Puzzle",
    "nl",
    "8K8-7JY-BXF"
  ],
  [
    "32",
    "4",
    "I'm a Goofy Goomber",
    "BеarWare",
    "BearWare",
    "RJL-74R-QJF",
    "A troll level collab themed around Goombas",
    "\"Done\"",
    "Expert",
    "SMB",
    "Troll",
    "FALSE",
    "Underground",
    "Underground",
    "None",
    "Long (> 4 minutes)",
    "If you're not playing this level, you're gonna turn into a Goomba!",
    "Wilfred, Stevo, BearWare, Soupbowl, Daftlife, Bedcliff, Foggles, Major, Marble and B0X. We all make troll levels except for Bedcliff but don't worry, he's getting there.",
    "5",
    "Troll",
    "us",
    "Coordinated uploads only."
  ],
  [
    "33",
    "5",
    "Pinball Repair",
    "♪WBC♪",
    "WBC [KR]#4158",
    "6S2-8YD-6JG",
    "Waluigi Time!",
    "\"Done\"",
    "Normal",
    "SMB3",
    "Puzzle",
    "TRUE",
    "Ground Night",
    "Ground Night",
    "None",
    "Medium (1:30-4 minutes)",
    "I dedicate this level to everyone who helped me! (Making looping music) #TM",
    "I dedicate this level to all the people around the world who have helped me. Thank you very much everyone. Good luck to you always.",
    "2",
    "Music",
    "kr",
    "V0K-607-GNG"
  ],
  [
    "34",
    "5",
    "Bullet Bell Battlements",
    "Dr. Lint",
    "PocketLint#2135",
    "8R5-6TJ-FKG",
    "Racing along side a banzai bill while you clear its path and you're own using the cannon box and catbell powerups.",
    "\"Done\"",
    "Super Expert",
    "3DW",
    "Platformer",
    "FALSE",
    "Castle",
    "Castle",
    "None",
    "Long (> 4 minutes)",
    "Dash through this dangerous castle full of blasters, banzais, cannons, and... cats? Whatever you do, don't lose your banzai buddy. He's your only ticket to escaping this deadly fortress, which may be the only proper use of the shooter level tag.",
    "Hey! I'm PocketLint (or Lint, or Dr. Lint, or Sir Pocket of the Lint Trap)! I'm a traditional level maker, contest enthusiast, and hider of ninja coins. I'm also incredibly jealous of DuffyWeber's voice. No one tell him.",
    "6",
    "Platforming ",
    "us",
    "XC0-WLR-S0G"
  ],
  [
    "35",
    "5",
    "Safety Thwomps",
    "Donkeymint",
    "DonkeyMintInc",
    "VCK-808-4TF",
    "A \"puzzleformer\" using nerfed thwomps that you can run on top of and touch from the side",
    "\"Done\"",
    "Super Expert",
    "SMW",
    "Platformer",
    "FALSE",
    "Sky",
    "Sky",
    "None",
    "Long (> 4 minutes)",
    "Thwomps are in tight spots, so feel free to use them to your financial advantage :))",
    "Donkeymint incorporated is the leading business at the forefront of donkey production.",
    "8",
    "Platforming, Puzzle ",
    "us",
    "QN4-6BP-D2G"
  ],
  [
    "36",
    "5",
    "Cloudy Chasm",
    "samfizz",
    "samfizz#5548",
    "PVL-LCK-JNG",
    "Dig clouds and descend, collecting enough coins before time runs out",
    "\"Done\"",
    "Easy",
    "SMB",
    "Platformer",
    "FALSE",
    "Underground",
    "Underground",
    "Number of coins",
    "Short (< 1:30 minutes)",
    "This subterranean shaft is full of riches and heavy fog. Dig into the depths, gather loot, and reach the bottom before your spelunking time is up!",
    "A maker who loves platformers and traditional levels. Samfizz strives to tell stories with fun themes and aesthetics, and appreciates a healthy dose of exploration and secrets.",
    "4",
    "Speedrun",
    "us",
    "XCS-PP9-4HF"
  ],
  [
    "37",
    "5",
    "Ligma Magma",
    "Luwuka",
    "Luwuka",
    "YY5-WK9-30G",
    "Lava is floor, but with a twist (collab with Mang)",
    "\"Done\"",
    "Super Expert",
    "SMW",
    "Platformer",
    "FALSE",
    "Castle",
    "Castle",
    "None",
    "Medium (1:30-4 minutes)",
    "Magma mia! Luwuka and Mang decided to open their (really) hot tub to the public!",
    "Luwuka now happily lives in Mang's basement.",
    "8",
    "Platformimg",
    "br",
    "8MF-58B-RVG"
  ],
  [
    "38",
    "5",
    "Wall Skipping Squeaks",
    "MrGarrison / MegaMarioX",
    "Mr. Garrison #1592",
    "N0H-41C-GPF",
    "Wall jumps with skipsqueak jump detector",
    "\"Done\"",
    "Expert",
    "3DW",
    "Platformer",
    "FALSE",
    "Ground",
    "Ground",
    "None",
    "Medium (1:30-4 minutes)",
    "Skips says he's the REAL JumpMan! He's got a new challenge for you, & NO powerups!",
    "Been playing MM2 since launch, but haven't uploaded too many levels because I have been working on a Mega Man/Mario hybrid super world, which should be ready soon!",
    "5",
    "Gimmick, Platforming",
    "us",
    "83T-YF3-2MF"
  ],
  [
    "39",
    "5",
    "Steam Surfin Steelworks",
    "RedRipper7",
    "RedRipper7#2944",
    "41R-STT-TPF",
    "Ride Lakitu Clouds to avoid Grinders & Lava Bubbles in Bowser's trash compactor",
    "\"Done\"",
    "Expert",
    "SMB3",
    "Traditional",
    "FALSE",
    "Underground",
    "Underground",
    "None",
    "Medium (1:30-4 minutes)",
    "After being dumped into Bowser's trash compactor, you must surf across the puffs of steam exhaust to avoid being minced and melted! ",
    "I'm a traditional level maker with a knack for aesthetics. I try to give all my levels that feeling of Nintendo authenticity. :-)",
    "6",
    "Autoscroll, Precision",
    "us",
    "DK7-WVY-LRG"
  ],
  [
    "40",
    "5",
    "The Crate Escape",
    "[Daftlife]",
    "daftlife",
    "ST4-NCL-24G",
    "A crate-companion troll level",
    "\"Done\"",
    "Normal",
    "3DW",
    "Troll",
    "FALSE",
    "Sky",
    "Sky",
    "None",
    "Medium (1:30-4 minutes)",
    "Boom Boom has stolen your gift for 7MMC! Take it back! (Troll)",
    "\"I make dumb stuff.\" Idk",
    "4",
    "Troll",
    "us",
    "4W4-J3K-JWG"
  ],
  [
    "41",
    "6",
    "Stasis Trial 时之试炼",
    "AuraSphere",
    "AuraSphere111",
    "RTX-RRV-QYF",
    "Gimmick level to utilize stasis rune (on/off+twister) to freeze enemy. ",
    "\"Done\"",
    "Normal",
    "SMB",
    "Gimmick",
    "FALSE",
    "Ghost House",
    "Ghost House",
    "None",
    "Medium (1:30-4 minutes)",
    "To you who set foot in this shrine, I am Angler Wigglar. In the name of Princess Peach, I offer this trial of stasis. ZA WARUDO!",
    "AuraSphere tries to recreate fun gameplay from other video games. After all, Mario Maker is Turing complete, right?",
    "5",
    "Puzzle, Link ",
    "cn",
    "4YH-1RQ-4VF"
  ],
  [
    "42",
    "6",
    "Eternal Boot",
    "Magatoro",
    "Magatoro",
    "QMX-59X-PXF",
    "Players have to avoid falling by taking off shoes repeatedly throughout the level.",
    "\"Done\"",
    "Expert",
    "SMB3",
    "Platformer",
    "FALSE",
    "Sky Night",
    "Sky Night",
    "None",
    "Medium (1:30-4 minutes)",
    "A heavier boot will fall, but if you take it off, it will rise again. Soar high into the sky with infinite jumps!",
    "Magatoro managed to finish to make this level, despite not having enough time to devote to making levels of Mario Maker this year.",
    "8",
    "Platforming ",
    "jp",
    "6S2-VLY-PMG"
  ],
  [
    "43",
    "6",
    "Incorporeal Investigation",
    "~Chichiri~",
    "Chichiri12345#6664",
    "D0M-NKR-BFF",
    "A puzzle/escape room utilizing ghosts to convey messages on how to escape.",
    "\"Done\"",
    "Normal",
    "NSMBU",
    "Puzzle",
    "FALSE",
    "Ghost House",
    "Ghost House Night",
    "None",
    "Long (> 4 minutes)",
    "The manor's ghosts have information to give you. Pay attention to them, and they'll help you escape! (Notepad recommended.)",
    "Other than troll levels, Chichiri's favourite level genre are puzzle levels. After making a bunch of one-screen puzzles, Chichiri decided to do something a bit more in-depth.",
    "5",
    "Puzzle",
    "ca",
    "J9J-0RD-XLG"
  ],
  [
    "44",
    "6",
    "Stumping to Conclusions",
    "lLucer",
    "lLucer#6640",
    "NLL-G6L-TNF",
    "Platforming level where stumps bounce in and out of lava",
    "\"Done\"",
    "Super Expert",
    "SMW",
    "Platformer",
    "FALSE",
    "Castle",
    "Castle",
    "None",
    "Medium (1:30-4 minutes)",
    "Stumps bouncing. Lava bubbling. Chomps abound. Don’t let your guard down.",
    "\"I like to try my best to make fun levels. Also, uh, words are hard-\" lLucer.exe has stopped working",
    "6",
    "Platforming ",
    "ie",
    "XTC-RYB-H9G"
  ],
  [
    "45",
    "6",
    "Fascinating Firebar Fort",
    "Samwe||",
    "Samwell",
    "0CS-2T2-LNF",
    "Exploration Platformer with interesting firebar patterns on tracks",
    "\"Done\"",
    "Expert",
    "NSMBU",
    "Platformer",
    "FALSE",
    "Castle",
    "Castle",
    "None",
    "Long (> 4 minutes)",
    "Don't stare at these fascinating flames for too long or you might get hyponotized by their perplexing patterns. I would like to state that I am not responsible for any dizzyness or nausia experienced when playing this level... probably",
    "My name is samwell, can't think of a description, so here's a haiku",
    "5",
    "Platforming ",
    "us",
    "G4B-4BP-MNF"
  ],
  [
    "46",
    "6",
    "TLoZ: Keylamari Temple",
    "Aegis Cook",
    "Aegis",
    "FDF-VT6-KDF",
    "Link water puzzle/platform dungeon",
    "\"Done\"",
    "Normal",
    "SMB",
    "Traditional",
    "FALSE",
    "Underwater",
    "Underwater",
    "None",
    "Medium (1:30-4 minutes)",
    "Root out intruders that have contaminated the waterworks. Don't forget to use your map and look at the hint panel!",
    "Aegis is just another traditional maker, just play the damn level will ya!",
    "5",
    "Puzzle, Link",
    "nl",
    "SWC-B3L-MJG"
  ],
  [
    "47",
    "6",
    "Parathwomp Pothole",
    "Shearwater",
    "Shearwater",
    "WR4-HGH-NCG",
    "Platformer where you have to ride on parathwomps and stuff",
    "\"Done\"",
    "Expert",
    "SMW",
    "Platformer",
    "FALSE",
    "Underground",
    "Underground",
    "None",
    "Medium (1:30-4 minutes)",
    "Traverse a cave where thwomps are your friends! ...Most of the time.",
    "A 7th grader who makes all kinds of levels and is also very close to getting a silver all-time medal for some reason.",
    "5",
    "Platforming ",
    "us",
    "LDK-B85-2QG"
  ],
  [
    "48",
    "6",
    "The Lambada",
    "Fehwul",
    "Fehwul and smpiano",
    "WN3-JH2-MYG",
    "Music level themed around using the bone bucket",
    "\"Done\"",
    "Super Expert",
    "SMB3",
    "Platformer",
    "TRUE",
    "Forest Night",
    "Forest Night",
    "None",
    "Short (< 1:30 minutes)",
    "The drybones shell is your partner for the night time platforming for the song of the forbidden dance.",
    "SM the talking piano recreates good songs in Mario Maker. Fehwul the chillest pirate adds the cool platforming.",
    "7",
    "Music, Autoscroll ",
    "co",
    "B4C-Q3Y-RRF"
  ],
  [
    "49",
    "6",
    "Bitevine Pipeline",
    "Lektor",
    "LektorSandvik",
    "JGF-2PG-D3G",
    "Piped piranha plant despawn hijinx. Collab with Kiavik.",
    "\"Done\"",
    "Super Expert",
    "3DW",
    "Platformer",
    "FALSE",
    "Underground",
    "Underground",
    "None",
    "Medium (1:30-4 minutes)",
    "Lektor and Kiavik can offer you bottomless salad and wings at the Gravlax Garden, the world's first Italo-Norwegian fusion restaurant! ",
    "Lektor is some guy who stumbled into 4YMM and somehow ended up being the promo guy. For 7MMC, he collaborates with Kiavik, who apparently had something to do with YMM as well?",
    "8",
    "Platforming",
    "no",
    "2NW-93F-F6G"
  ],
  [
    "50",
    "6",
    "Crossroads (4P VS)",
    "RenaldoMun",
    "RenaldoMun#8311",
    "4FF-QQB-YYF",
    "Multiplayer Puzzle using screen scroll lock",
    "\"Done\"",
    "Normal",
    "SMW",
    "Puzzle",
    "FALSE",
    "Snow",
    "Forest",
    "None",
    "Long (> 4 minutes)",
    "Four friends entered this winter wonderland only to become separated. They can see one another, but a mysterious force will not allow them to join together. Players must figure out the puzzle on their own screen while sharing items and resources in order to escape the Crossroads. 4 players are required. Voice chat is highly recommended to coordinate.  ",
    "I'm the RenaldoMun. I love to connect people for fun and laughs. Multiplayer levels have become my forte. Grateful for Luqueto's collaboration and inspiring ideas! Big thanks to great multiplayer crew who helped test all these levels, especially CannibalTurtle, RX7man, SaltyPeregrine, Theorymon, and iAreNubcake. ",
    "5",
    "Puzzle, 4 Player Co-op (versus mode)",
    "us",
    "XFW-8X4-7QF"
  ],
  [
    "51",
    "6",
    "Breaking the 4th Wall",
    "Luqueto",
    "luqueto1",
    "XB2-7TJ-WMG",
    "Multiplayer puzzle using scroll stop",
    "\"Done\"",
    "Normal",
    "SMW",
    "Puzzle",
    "FALSE",
    "Ghost House",
    "Ghost House",
    "None",
    "Long (> 4 minutes)",
    "In this 4 player Versus Mode Puzzle, you have to work together and think outside of the box to find a way out of this haunted mansion.",
    "When Luqueto played Mario Maker 2, he fell in love with the game. This is Luqueto, a guy that loves creative things. From Mario Maker to playing music, from painting to dancing and anything that he can learn and express himself. He had an amazing journey to learn SMM2 Multiplayer in which he and RenaldoMun have worked together and developed very interesting contraptions that wouldn't be possible without help from all lovely play testers that endured all bugs on their levels. Special thanks to Renaldo! They hope you all enjoy the level.",
    "5",
    "Puzzle, 4 Player Co-op (versus mode)",
    "br",
    "DKR-3DD-HXF"
  ],
  [
    "52",
    "6",
    "Sabotage (2v2 VS)",
    "RenaldoMun",
    "RenaldoMun#8311",
    "4FF-QQB-YYF",
    "Multiplayer 2v2 Team Troll",
    "\"Done\"",
    "Normal",
    "SMB3",
    "Troll",
    "FALSE",
    "Ground",
    "Underground",
    "None",
    "Long (> 4 minutes)",
    "Bros Vs Toads! With good timing and skill, you can activate trolls to kill the other team in this 2v2 level.  Each kill will count a point (sideways spring) for your team. After both teams get to troll, check scoreboard to find out who won. Winning team will get first shot at the goal. If its a tie....then look out for a mad dash to the end!",
    "Years back, an enormous white cat appeared out of nowhere, devoured all the fish in the lake, and then ran off. He called himself Renaldo Moon. Unfortunately, he had to shorten it for Nintendo to RenaldoMun. Now he spares the fish and only devours Mario lives with multiplayer trolls. ",
    "5",
    "Troll, 2v2 Multiplayer versus",
    "us",
    "QBY-YJ4-00H"
  ]
]
