[["order","batchNumber","levelName","makerName","discordName","makerId","briefDescription","progress","difficultyName","gameStyle","Genre","Music?","mainTheme","subTheme","clearCondition","averageClearTime","description","makerDescription","difficulty","tags","nationality","levelCode"],["1","1","Heart of the Mountain","MangMang69","Mang","4TF-6MS-74G","Celeste music level wall conveyorbelts","\"Done\"","Normal","SMW","Gimmick","TRUE","Underground","Underground","None","Long (> 4 minutes)","\"Gotta climb fast\" ~ Madeline 2023","Despite everything, Mang is still Mang.","5","Music, Platforming","de","5V9-NHB-VQG"],["2","1","Blockswap Bumpers","RadicalR","RadicalReactions99","L05-78J-BMG","Bumpers act like on/off switches","\"Done\"","Expert","SMB","Platformer","FALSE","Castle","Castle","None","Medium (1:30-4 minutes)","Mario has stumbled upon the lair of the Nice Donut Blockers. These strange, rubbery beings possess the ability to switch the state of on/off blocks at will. Their sole purpose in life is to guard the various on/off gates within the fortress and prevent intruders from getting to their secret stash of balloons. Honestly though, the Blockers don't seem all that tough... maybe they'll be convinced to let Mario through if he smacks 'em around a bit.","RadicalR is a 16 year old maker who participated in 7MMC and is glad to be back for another year. He likes gimmicks, on/off switches, blue platforms, vertical levels, and bad puns. People tell him he's a contrarian, but he doesn't agree.","5","Platforming, Gimmick","us","CPR-5RW-20G"],["3","1","OK BOOMERangs","Paxsman","Paxsman","S2W-5WH-JLG","Throw boomerang while riding enemies","\"Done\"","Expert","3DW","Platformer","FALSE","Underground","Underground","None","Medium (1:30-4 minutes)","Boomerang level, where you throw boomerangs. Mario Maker is like a boomerang too, I keep throwing it away and it keeps coming back, which is also the plot of my new indie horror movie, \"Wowie Zowie\".","The celebrity alphabet joke is done, it ran it's course, if you're a fan too bad so sad, send hatemail to Paxsman.","6","OK, BOOMER","us","5JN-6SG-V0G"],["4","1","Plummeting Pillar Palace","Terimas","Terimas","1XC-1ND-HPF","Link dungeon","\"Done\"","Expert","SMB","Puzzle","FALSE","Ghost House","Ghost House","None","Long (> 4 minutes)","Explore a dungeon that changes its form as you delve deeper. Use the map to navigate your way around and challenge Gloom Boom who lurks in the depths of this lair.","I like devious puzzles, clever contraptions, entity limit shenanigans and perhaps overly complicated levels.","5","Link, Puzzle","fi","WRV-4KH-XLG"],["5","1","Donkeymint Inc. HQ","Grakowsky","grakowsky","3CR-Q53-VHG","Puzzle-platformer involving cannons","\"Done\"","Expert","SMB","Puzzle","FALSE","Castle","Castle","None","Long (> 4 minutes)","Donkeymint Incorporated: manufacturer of top tier Mario Maker levels... but is it all just a cover-up? You sense a much more sinister operation driving the business. After countless unreturned phone calls, emails, and letters, you are finally invited on a tour of the headquarters. When you arrive, no one is there to greet you and the door is locked. You get the feeling no one survives the tour...","Grakowsky loves to make and play puzzles - sometimes platformers too - sometimes puzzle-platformers! He hopes to one day finish his own puzzle game after the sun has finally set over Mario Maker 2.","6","Puzzle, Platforming","us","W38-XHR-2QG"],["6","1","Blaster and Commander","Donkeymint","Donkey_Mint_Inc","VCK-808-4TF","Blaster walls","\"Done\"","Super Expert","NSMBU","Platformer","FALSE","Ghost House","Ghost House","None","Medium (1:30-4 minutes)","Command these blaster walls to make your way, or be crushed by their unforgiving wallness.","Donkeymint incorporated is the leading business at the forefront of donkey production.","6","Single Player, Autoscroll","us","5VW-MVX-KSF"],["7","1","Marble Machine Course","Luwuka","Luwuka","YY5-WK9-30G","Wintergatan's Marble Machine music level","\"Done\"","Normal","SMB3","Puzzle","TRUE","Snow Night","Snow","None","Medium (1:30-4 minutes)","A tribute to the marvelous 'Marble Machine' by Wintergatan!","Mang let Luwuka out of the basement for a brief moment for this event.","4","Music, Puzzle","br","HRW-MP3-7GG"],["8","1","Levitation Sensation","marc0-pol0","marc0-pol0","7M3-SBL-NQF","Stuff flies up from the bottom of the screen","\"Done\"","Expert","SMB3","Gimmick","FALSE","Sky","Sky","None","Medium (1:30-4 minutes)","Levitation: the phenomenon of a person or thing rising into the air by apparently supernatural means. ","marc0-pol0 is a maker who likes coming up with new ideas for levels that others may not have seen before. He has an introverted personality, and a passion for creative hobbies. In the real world he's an artist who sells photorealistic pen drawings. ","6","Autoscroll, Single Player","gb","WFC-1QF-C6G"],["9","1","Sidewinder Sliderider","shearwater","Shearwater","WR4-HGH-NCG","Riding snake blocks","\"Done\"","Expert","SMB3","Platformer","FALSE","Desert","Desert","None","Medium (1:30-4 minutes)","Use the mechanical snakes to ride your way to victory in this course which some have dared to call a \"good snake block level.\"","\"I make levels.\" ~Shearwater, not knowing what else to write about himself","5","Platforming, \"snake block levle\"","us","PX8-9F4-92H"],["10","1","MISSION: POSSIBLE - Stealth","ShuShuro","ShuShuro","5T5-H68-N7G","Stealth level with Mission Impossible music","\"Done\"","Expert","SMB3","Traditional","TRUE","Ghost House Night","Forest Night","None","Medium (1:30-4 minutes)","The mushroom kingdom has been sucked into the movie \"MISSION: IMPOSSIBLE\". In the world of high technology, Bowser worked with his men to build a fortress equipped with state-of-the-art technologies such as detection sensors and elevators. In response, authorities appointed Bowser's foe Mario as an agent and assigned him the task of taking the fortress. They also sent this P.S. \"Be careful of the detection sensors located throughout the fortress. If you show perfect stealth behavior that goes undetected, we will give you additional celebration gifts.\"","ShuShuro is interested in recreating various series of games through Mario Maker. Recently, there are rumors that they are expanding their horizons to movies and attempting to create cinematic levels.","4","Stealth, Action","kr","39H-T00-7LG"],["11","1","King Goonie's Lunar Lair","Gilmore","Papa Laz [Gilmore]","J2W-01H-QMG","Cape spin level","\"Done\"","Super Expert","SMW","Platformer","FALSE","Sky Night","Castle","None","Short (< 1:30 minutes)","At the heart of the goonies’ moon empire is the ancient Goonie King’s crypt. Steal King Goonie's mystic golden feather and escape!","Mario maker oldhead who likes making cool platforming levels. Favorite platformers are Mario Sunshine, Yoshi’s Island and the DKC series.","6","Single Player, Short and Sweet","us","C9K-1HD-SRF"],["12","1","Captain Toad's Fire'N'Ice","Theorymon","Theorymon","23T-F50-5WG","Captain toad level","\"Done\"","Expert","3DW","Gimmick","FALSE","Castle","Snow","None","Long (> 4 minutes)","A few months back, Toad Brigade were discussing how to celebrate the 10th anniversary of their legendary Sprixie Kingdom expedition. After a fierce debate, they needed a tie breaker between \"some place frosty\" and \"some place hot\". Toadette thinks of a brilliant idea, \"why not both at Mount Jumpmore!\"\n\nMount Jumpmore is a luxury ski resort, with warm, lava heated spas that are to die for! This is a pretty pricey resort though, even Luigi would think twice before coughing up the cash! Banktoad (yes seriously, that's his name!) claims he can find a great deal with his \"methods\" though, so against the Captain's better judgment, they book a flight with Booster Air…\n\nFlash Forward to now, where they've arrived at their destination. Barely able to contain his excitement, Banktoad jumps into the air and explains \"READY FOR VACATION!\". This is where things took a turn for the worse..\n\nThe moment the poor green toad jumps, a P-switch activation is heard… and the floor beneath him disappears, causing him to fall to his doom! \n\nMailtoad (seriously why are these toads named after their jobs?), being the nervous sort, long jumps to a cloud. But far from being safe, life had a different package in mind: a blaster delivered to the top of his head!\n\n\"Oh those idiots, this isn't Mount Jumpmore… it's MOUNT JUMPLESS!\" screams Hint Toad (is that even a job?!)\n\nMount Jumpless is the notorious (and far cheaper!) mountain NEXT to Mount Jumpmore. This isn't a resort: it's a deadly set of lava infested ruins that's been claiming the souls of Toad explorers for the past 280 years! Legends say a strange flying reptile cursed a once proud civilization to misfortune whenever they jumped… and that sure seems to be in action to this day!\n\nAnd yet, Toadette smiles wryly, because there's a bright side to this disaster: legends also told of the ancient civilization hiding away a wonderful flying machine, one that you don't even need to jump with! But to reach this incredible treasure, you'll need to find the 4 sacred \"secret exits\", and plunder the pink tokens within.\n\n\"Are you crazy Toadette?! Did you even comprehend what just happened to those two? Forget the treasure, we gotta get outta here!\"\n\nBut it was no use, Toadette doesn't care about meager \"dangers\", she was here to make her fortune by claiming the legendary flying machine!\n\nAnd that's where you come in: will you side with Toad and simply fight for survival, or will you join Toadette to find the 4 secret paths soar to the skies… WITHOUT JUMPING!","Theorymon's a guy on the internet who plays way too much Mario, competitive Pokemon, and Touhou! When it comes to Mario Maker, he loves to make courses that challenge the idea of what it means to be Mario. This time, to celebrate the 10th anniversary of Super Mario 3D World, he made a course that pays tribute to Captain Toad, and the many ways you can play Mario without jumping!","8","Puzzle, Technical","us","K09-X11-V4G"],["13","1","Project: S.P.I.N.","PsicoYak","Psicoyak","P4N-STQ-JMG","Thwomp spike ball dispenser","\"Done\"","Expert","NSMBU","Platformer","FALSE","Airship","Airship","None","Medium (1:30-4 minutes)","Thwomp Industries just released their brand new Spike-Powered Improved lauNcher™, a special device which will reward Mario's timing by greatly enhancing his jumping abilities. Let's give it a test run!","Your friendly lasagna-loving level maker! I enjoy making music levels A LOT, but lately I've started experimenting with other genres too. I love Persona 5, Oneshot, the Zelda series and -of course- Mario Maker!","5","Autoscroll, Single Player","it","FLY-CVH-CTF"],["14","1","Escape from Shroom Manor","samfizz","samfizz","PVL-LCK-JNG","Exploration/puzzle mushroom level","\"Done\"","Expert","NSMBU","Puzzle","FALSE","Ghost House","Ghost House","None","Medium (1:30-4 minutes)","You'll need to be clever if you want to get out of the mansion alive. Explore its halls, solve its secrets, and use shapeshifting shrooms—squeeze through tight spaces and bring the house down!","A maker who enjoys creating and playing traditional levels. He appreciates a healthy dose of exploration and secrets.","4","Exploration, Puzzle","us","M1W-5WY-RVG"],["15","1","A SkeleTON of Fun","wSacha","Sacha","LF4-P8F-6WG","Undertale music level","\"Done\"","Expert","SMB","Platformer","TRUE","Snow Night","Snow Night","None","Short (< 1:30 minutes)","Experience what it feels like to go on a date with Papyrus! A level for all the spaghetti lovers out there, because as the great Papyrus once said : \"THAT'S RIGHT, HUMAN! YOU CAN WIN!! JUST DO WHAT I, WOULD DO... BELIEVE IN YOU!!!\"","As someone who always loved platforming games and music, Sacha found herself hooked on making Mario Maker music levels. During her time at 7MMC, none of the many music levels she attempted to build felt good enough for the event, and she instead focused on a platforming level. Which is why this year, she's going all-in with a level featuring one of her favorite themes from Undertale. Sacha also loves to occasionally create logic-based machines in Mario Maker, and her favorite artists are Jhariah and Glass Beach.","4","Music, Platforming","ca","54S-1HQ-KWG"],["16","1","The Floating Trollship","Tutajkk","Tutajkk","KR5-7T0-5LF","Troll level","\"Done\"","Expert","NSMBU","Troll","FALSE","Airship Night","Castle Night","None","Long (> 4 minutes)","Newcomer friendly troll level, one of my finest.","Creating custom levels has been a creative outlet for me: from Portal 2 puzzle maps to coop-focused adventure maps in Terraria, I've been building stuff in video games for over a decade now. I've been focusing on Mario Maker 2 as of late because this game has the building blocks and tools to create unique experiences AND an awesome, supportive community I just love creating levels for! Over time I developed a reputation for my \"simple trolls\" - troll levels designed with a low barrier to entry, so they may be enjoyed by all.\n","3","Troll","hu","CPM-TV3-NNF"]]